src/InformationRegisters/инкОсобыеУсловияТруда/инкОсобыеУсловияТруда.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>инкОсобыеУсловияТруда</name>
  <resources>
    <name>Тариф</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>УсловияТрудаКласс</name>
    <type>
      <types>EnumRef.инкУсловияТрудаКласс</types>
    </type>
  </dimensions>
  <dimensions>
    <name>УсловияТрудаПодкласс</name>
    <type>
      <types>EnumRef.инкУсловияТрудаПодкласс</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Enums/инкУсловияТрудаКласс/инкУсловияТрудаКласс.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>инкУсловияТрудаКласс</name>
  <enumValues>
    <name>Опасный</name>
  </enumValues>
  <enumValues>
    <name>Вредный</name>
  </enumValues>
  <enumValues>
    <name>Допустимый</name>
  </enumValues>
  <enumValues>
    <name>Оптимальный</name>
  </enumValues>
</mdclass:Enum>

src/Enums/инкУсловияТрудаПодкласс/инкУсловияТрудаПодкласс.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>инкУсловияТрудаПодкласс</name>
  <enumValues>
    <name>Подкласс4</name>
  </enumValues>
  <enumValues>
    <name>Подкласс34</name>
  </enumValues>
  <enumValues>
    <name>Подкласс33</name>
  </enumValues>
  <enumValues>
    <name>Подкласс32</name>
  </enumValues>
  <enumValues>
    <name>Подкласс31</name>
  </enumValues>
  <enumValues>
    <name>Подкласс2</name>
  </enumValues>
  <enumValues>
    <name>Подкласс1</name>
  </enumValues>
</mdclass:Enum>

src/InformationRegisters/инкОсобыеУсловияТруда/ManagerModule.bsl
#Область о //Обновление ИБ:

// Обработчик обновления УТ 11.0.0.6
//
// Первоночальное заполнение.
//
Процедура ПервоночальноеЗаполнение_11_0_0_6() Экспорт
	
	//	На 2020 год:
	//	Особые условия труда:
	Набор = РегистрыСведений.инкОсобыеУсловияТруда.СоздатьНаборЗаписей();
	//
	Запись = Набор.Добавить();
	Запись.Период = Дата("20200101000000");
	Запись.УсловияТрудаКласс	= Перечисления.инкУсловияТрудаКласс.Опасный;	
 	Запись.УсловияТрудаПодкласс = Перечисления.инкУсловияТрудаПодкласс.Подкласс4;
	Запись.Тариф                = 8; 
	//
	Запись = Набор.Добавить();
	Запись.Период = Дата("20200101000000");
	Запись.УсловияТрудаКласс	= Перечисления.инкУсловияТрудаКласс.Вредный;	
 	Запись.УсловияТрудаПодкласс = Перечисления.инкУсловияТрудаПодкласс.Подкласс34;
	Запись.Тариф                = 7; 
	//
	Запись = Набор.Добавить();
	Запись.Период = Дата("20200101000000");
	Запись.УсловияТрудаКласс	= Перечисления.инкУсловияТрудаКласс.Вредный;	
 	Запись.УсловияТрудаПодкласс = Перечисления.инкУсловияТрудаПодкласс.Подкласс33;
	Запись.Тариф                = 6; 
	//
	Запись = Набор.Добавить();
	Запись.Период = Дата("20200101000000");
	Запись.УсловияТрудаКласс	= Перечисления.инкУсловияТрудаКласс.Вредный;	
 	Запись.УсловияТрудаПодкласс = Перечисления.инкУсловияТрудаПодкласс.Подкласс32;
	Запись.Тариф                = 4; 
	//
	Запись = Набор.Добавить();
	Запись.Период = Дата("20200101000000");
	Запись.УсловияТрудаКласс	= Перечисления.инкУсловияТрудаКласс.Вредный;	
 	Запись.УсловияТрудаПодкласс = Перечисления.инкУсловияТрудаПодкласс.Подкласс31;
	Запись.Тариф                = 2; 
	//
	Запись = Набор.Добавить();
	Запись.Период = Дата("20200101000000");
	Запись.УсловияТрудаКласс	= Перечисления.инкУсловияТрудаКласс.Допустимый;	
 	Запись.УсловияТрудаПодкласс = Перечисления.инкУсловияТрудаПодкласс.Подкласс2;
	Запись.Тариф                = 0; 
	//
	Запись = Набор.Добавить();
	Запись.Период = Дата("20200101000000");
	Запись.УсловияТрудаКласс	= Перечисления.инкУсловияТрудаКласс.Оптимальный;	
 	Запись.УсловияТрудаПодкласс = Перечисления.инкУсловияТрудаПодкласс.Подкласс1;
	Запись.Тариф                = 0; 
	//
	Набор.Записать(Истина);
	
КонецПроцедуры

#КонецОбласти
